# Housing Market

### Introduction:
This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [8]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows:
1. The first a random number from 1 to 4
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     1
1     2
2     2
3     1
4     1
     ..
95    2
96    4
97    1
98    1
99    2
Length: 100, dtype: int32 0     1
1     2
2     2
3     1
4     2
     ..
95    1
96    2
97    2
98    3
99    2
Length: 100, dtype: int32 0     29136
1     20357
2     29474
3     14317
4     17022
      ...
95    21413
96    21639
97    22358
98    26183
99    28078
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
housemarket = pd.concat([s1, s2, s3], axis=1)
housemarket.head()

   0  1      2
0  1  1  29136
1  2  2  20357
2  2  2  29474
3  1  1  14317
4  1  2  17022

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
housemarket.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemarket.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            29136
1      2       2            20357
2      2       2            29474
3      1       1            14317
4      1       2            17022

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [12]:
# join concat the values
all_data_col = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
all_data_col = all_data_col.to_frame()
print(type(all_data_col))

all_data_col

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       2
2       2
3       1
4       1
..    ...
95  21413
96  21639
97  22358
98  26183
99  28078

[300 rows x 1 columns]

### Step 6.  Oops, it seems it is going only until index 99. Is it true?

In [13]:
len(all_data_col)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
all_data_col.reset_index(drop=True, inplace=True)
all_data_col

         0
0        1
1        2
2        2
3        1
4        1
..     ...
295  21413
296  21639
297  22358
298  26183
299  28078

[300 rows x 1 columns]